In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from numpy import nan

In [5]:
df=pd.read_excel('TestImputationEDA.xlsx')

In [17]:
df.dtypes

Name       object
Point     float64
Salary    float64
dtype: object

In [18]:
df_num=df.select_dtypes(include=float)

In [19]:
df_num.head()

   Point    Salary
0   10.0    5000.0
1    2.0       NaN
2    4.0  250000.0
3    NaN    6000.0
4   14.0   10000.0

In [6]:
df.head()

     Name  Point  Salary
0  Ashwin     10    5000
1  Partha      2       0
2  Nandha      4  250000
3     Sai      0    6000
4    Hari     14   10000

In [7]:
df = df.replace(0, nan)

In [8]:
df.head()

     Name  Point    Salary
0  Ashwin   10.0    5000.0
1  Partha    2.0       NaN
2  Nandha    4.0  250000.0
3     Sai    NaN    6000.0
4    Hari   14.0   10000.0

1.Simple Imputation

In [ ]:
#Default Mean

In [20]:
from sklearn.impute import SimpleImputer
simImp=SimpleImputer()
df_simImp=simImp.fit_transform(df_num)

In [22]:
df_simImp

array([[1.000e+01, 5.000e+03],
       [2.000e+00, 6.775e+04],
       [4.000e+00, 2.500e+05],
       [7.500e+00, 6.000e+03],
       [1.400e+01, 1.000e+04]])

2.KNN Imputation

In [29]:
from sklearn.impute import KNNImputer
imputer=KNNImputer(n_neighbors=3)
df_knnImp=imputer.fit_transform(df_num)
df_knnImp

array([[1.00000000e+01, 5.00000000e+03],
       [2.00000000e+00, 8.83333333e+04],
       [4.00000000e+00, 2.50000000e+05],
       [9.33333333e+00, 6.00000000e+03],
       [1.40000000e+01, 1.00000000e+04]])